InformationRegisters/смсСостоянияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>смсСостоянияСообщений</Name>
			<Comment>Состояния сообщений</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>GUID</Name>
					<Comment>Уникальный идентификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.смсСостоянияСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>sms_id</Name>
					<Comment>Идентификатор СМС Билайн</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SMS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Comment>Номер строки документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗаявкиНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияЗаявкиНаРемонт</Name>
			<Comment>Состояния заявки на ремонт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
					<Comment>Подтверждено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/смсСостоянияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>смсСостоянияСообщений</Name>
			<Comment>Состояния Сообщений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
					<Comment>Сообщение ждет отправки на сервер SMS4B</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
					<Comment>Сообщение отправлено на сервер SMS4B и ждёт отправки оператору</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
					<Comment>Сообщение отправлено на сервер оператору</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлено</Name>
					<Comment>Сообщение не удалось отправить на сервер оператору (истек срок жизни sms сообщения)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
					<Comment>Сообщение доставлено клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДоставлено</Name>
					<Comment>Сообщение не доставлено клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Сообщение не удалось отправить</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
					<Comment>Получено входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоЧастично</Name>
					<Comment>Получены не все части входящего сообщения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СМ_ОтправкаСМС/Ext/Module.bsl
//// Процедуры / функции для отправки СМС
////////////////////////////////////////////////

Функция ОтправитьСМС(ДокументОснование, ТекстСМС) Экспорт
	Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: не задан документ основание!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(ТекстСМС) Тогда
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: не заполнен текст сообщения!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;
	Если СтрДлина(ТекстСМС) > 480 Тогда
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: Длина сообщения превышает 480 символов!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;
	
	НовыйОбъектСМС = Документы.SMS.СоздатьДокумент();
	НовыйОбъектСМС.Заполнить(ДокументОснование);
	НовыйОбъектСМС.ТекстСообщения = ТекстСМС;
	Для Каждого Получатель Из НовыйОбъектСМС.Получатели Цикл
		ТелефонЦифрами = Прав(ОставитьТолькоЦифры(Получатель.НомерТелефона), 10);
		Если СтрДлина(ТелефонЦифрами) <> 10 Или Лев(ТелефонЦифрами, 1) <> "9" Тогда
			#Если Клиент Тогда
			Сообщить("Не удалось отправить СМС: номер " + Получатель.НомерТелефона + 
					" не является номером сотового телефона!", СтатусСообщения.Важное);
			#КонецЕсли
			Возврат Ложь;
		КонецЕсли;
		Получатель.ТекстСообщения = ТекстСМС;
	КонецЦикла;
	НовыйОбъектСМС.Записать();
	
	СтрокаОшибки = НовыйОбъектСМС.ОтправитьSMS();
	Если ПустаяСтрока(СтрокаОшибки) Тогда
		НовыйОбъектСМС.Записать();
		Возврат Истина;
	Иначе
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: " + СтрокаОшибки, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

Функция ОтправитьСМСПоНомеру(Кому, НомерТелефона, ТекстСМС) Экспорт
	ТелефонЦифрами = Прав(ОставитьТолькоЦифры(НомерТелефона), 10);
	Если СтрДлина(ТелефонЦифрами) <> 10 Или Лев(ТелефонЦифрами, 1) <> "9" Тогда		
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: " + НомерТелефона + 
				" не является номером сотового телефона!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(ТекстСМС) Тогда
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: не заполнен текст сообщения!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;
	Если СтрДлина(ТекстСМС) > 480 Тогда
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: Длина сообщения превышает 480 символов!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;

	НовыйОбъектСМС = Документы.SMS.СоздатьДокумент();
	ДокументОснование = Документы.РабочийЛист.ПустаяСсылка();
	НовыйОбъектСМС.Заполнить(ДокументОснование);
	НовыйОбъектСМС.Организация = ПараметрыСеанса.Организация;
	НовыйОбъектСМС.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	НовыйОбъектСМС.ДокументОснование = ДокументОснование;
	НовыйОбъектСМС.ТекстСообщения = ТекстСМС;
	Для Каждого Получатель Из НовыйОбъектСМС.Получатели Цикл
		Получатель.Контрагент = Кому;
		Получатель.НомерТелефона = НомерТелефона;
		Получатель.ТекстСообщения = ТекстСМС;
	КонецЦикла;
	НовыйОбъектСМС.Записать();
	
	СтрокаОшибки = НовыйОбъектСМС.ОтправитьSMS();
	Если ПустаяСтрока(СтрокаОшибки) Тогда
		НовыйОбъектСМС.Записать();
		Возврат Истина;
	Иначе
		#Если Клиент Тогда
		Сообщить("Не удалось отправить СМС: " + СтрокаОшибки, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

Функция ТелефонЦифрами(Объект)
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Значение = Объект;
	НаборЗаписейКИ.Отбор.Объект.Использование = Истина;
	НаборЗаписейКИ.Отбор.Тип.Значение = Перечисления.ТипыКонтактнойИнформации.Телефон;
	НаборЗаписейКИ.Отбор.Тип.Использование = Истина;
	НаборЗаписейКИ.Прочитать();
	Представление = "";
	СтруктураТелефон = Новый Структура();
	СтруктураТелефон.Вставить("Представление", Представление);
	СтруктураТелефон.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Для каждого Запись Из НаборЗаписейКИ Цикл
		Если ПустаяСтрока(Запись.Поле1) Тогда
			Представление = Запись.Поле2 + Запись.Поле3;
		Иначе
			Представление = Запись.Поле1 + Запись.Поле2 + Запись.Поле3;
			Представление = Сред(Представление, 2);
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Представление) Тогда
			Для сч = 1 По СтрДлина(Запись.Представление) Цикл
				СимволИзНомера = Сред(Запись.Представление, сч, 1);
				Если СтрНайти("1234567890", СимволИзНомера) > 0 Тогда
					Представление = Представление + СимволИзНомера;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		СтруктураТелефон.Вставить("Представление", Представление);
		СтруктураТелефон.Вставить("Вид", Запись.Вид);
		
		Если Запись.ЗначениеПоУмолчанию Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураТелефон;
КонецФункции

Функция ПолучитьПредставлениеКИДляСМС(Объект, ЗначениеКИ) Экспорт
	Представление = "";
	
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Значение      = Объект;
	НаборЗаписейКИ.Отбор.Объект.Использование = Истина;
	Если ТипЗнч(ЗначениеКИ) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
		НаборЗаписейКИ.Отбор.Вид.Значение = ЗначениеКИ;
		НаборЗаписейКИ.Отбор.Вид.Использование = Истина;
		НаборЗаписейКИ.Прочитать();
		Для Каждого ЗаписьКИ Из НаборЗаписейКИ Цикл
			Если ЗаписьКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				Если ЗначениеЗаполнено(ЗаписьКИ.Поле3) Тогда
					Представление = ЗаписьКИ.Поле3 + ", " + ЗаписьКИ.Поле5;
				ИначеЕсли ЗначениеЗаполнено(ЗаписьКИ.Поле4) Тогда
					Представление = ЗаписьКИ.Поле4;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаписьКИ.Поле6) Тогда
					Представление = Представление + ", " + ЗаписьКИ.Поле6;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаписьКИ.Поле7) Тогда
					Представление = Представление + ", " + ЗаписьКИ.Поле7;
				КонецЕсли;			
				
			ИначеЕсли ЗаписьКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Если ЗначениеЗаполнено(ЗаписьКИ.Поле1) Тогда
					Представление = ЗаписьКИ.Поле1;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаписьКИ.Поле2) Тогда
					Представление = Представление + " (" + ЗаписьКИ.Поле2 + ")";
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаписьКИ.Поле3) И СтрДлина(ЗаписьКИ.Поле3) > 5 Тогда
					Телефон = Лев(ЗаписьКИ.Поле3, 3);
					ТелефонВспом = Сред(ЗаписьКИ.Поле3, 4);
					Телефон = Телефон + "-" + Лев(ТелефонВспом, 2) + "-" + Сред(ТелефонВспом, 3);
					Представление = Представление + " " + Телефон;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Представление) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	Возврат Представление;
КонецФункции

//Функция возвращает номер телефона в котором присутствуют только символы цифр
Функция ОставитьТолькоЦифры(НомерТелефона) Экспорт
	ТолькоЦифрыНомера = "";
	Для сч = 1 По СтрДлина(НомерТелефона) Цикл
		СимволИзНомера = Сред(НомерТелефона, сч, 1);
		Если СтрНайти("1234567890", СимволИзНомера) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + СимволИзНомера;
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифрыНомера;
КонецФункции


////////////////////////////////////////////////
// Процедуры регламентных заданий

// Рассылка СМС напоминаний о записи на ремонт
Процедура НапоминанияОЗаписиНаРемонт(Параметры = Неопределено) Экспорт
	ДатаНачала = НачалоДня(ТекущаяДата() + 86400); // на завтра
	ДатаОкончания = КонецДня(ДатаНачала);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ПланРемонта", Справочники.ХозОперации.ПланРемонта);
	Запрос.УстановитьПараметр("Отклонено", Перечисления.СостоянияЗаявкиНаРемонт.Отклонено);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаРемонт.ДатаНачала КАК ДатаНачала,
	|	ЗаявкаНаРемонт.Заказчик КАК Заказчик,
	|	ЗаявкаНаРемонт.ПредставлениеТелефона КАК Телефон,
	|	ЗаявкаНаРемонт.Ссылка КАК Ссылка,
	|	ЗаявкаНаРемонт.ПодразделениеКомпании КАК Подразделение,
	|	ЗаявкаНаРемонт.Автомобиль КАК Автомобиль,
	|	ЗаявкаНаРемонт.Организация.Наименование КАК Организация,
	|	ЗаявкаНаРемонт.ПодразделениеКомпании.ДилерскийЦентр.Наименование КАК ДилерскийЦентр
	|ИЗ
	|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|ГДЕ
	|	ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаявкаНаРемонт.Состояние <> &Отклонено
	|	И ЗаявкаНаРемонт.Проведен";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого Заявка Из Результат Цикл
		ТекстСМС = "";
		Если ЗначениеЗаполнено(Заявка.Заказчик) Тогда
			Если ТипЗнч(Заявка.Заказчик) = Тип("СправочникСсылка.Контрагенты") Тогда
				Если Заявка.Заказчик.НашаФирма Тогда
					Продолжить;
				ИначеЕсли Заявка.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
					ТекстСМС = Заявка.Заказчик.Имя + " " + Заявка.Заказчик.Отчество + ", ";
				Иначе
					ТекстСМС = Заявка.Заказчик.Наименование + ", ";
				КонецЕсли;
				
			Иначе
				ТекстСМС = СокрЛП(Заявка.Заказчик) + ", ";
			КонецЕсли;
		КонецЕсли;
		
		ТекстСМС = ТекстСМС + "Напоминаем, Вы записаны в сервисный центр " + Заявка.ДилерскийЦентр + " ";
		ТекстСМС = ТекстСМС + Формат(Заявка.ДатаНачала, "ДФ='дд.ММ.гггг ЧЧ:мм'");
		
		ТекущееПодразделение = Заявка.Подразделение;
		Пока Не ТекущееПодразделение.Пустая() Цикл
			ПодразделениеАдрес = СМ_ОтправкаСМС.ПолучитьПредставлениеКИДляСМС(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресФактический);
			Если обЗначениеНеЗаполнено(ПодразделениеАдрес) Тогда
				ПодразделениеАдрес = СМ_ОтправкаСМС.ПолучитьПредставлениеКИДляСМС(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПодразделениеАдрес) Тогда
				ТекстСМС = ТекстСМС + ". Адрес: " + ПодразделениеАдрес;
				Прервать;
			Иначе
				ТекущееПодразделение = ТекущееПодразделение.Родитель;
				Продолжить;
			КонецЕсли;
		КонецЦикла;

		ТекущееПодразделение = Заявка.Подразделение;
		Пока Не ТекущееПодразделение.Пустая() Цикл
			ПодразделениеТелефон = СМ_ОтправкаСМС.ПолучитьПредставлениеКИДляСМС(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
			Если обЗначениеНеЗаполнено(ПодразделениеТелефон) Тогда
				ПодразделениеТелефон = СМ_ОтправкаСМС.ПолучитьПредставлениеКИДляСМС(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПодразделениеТелефон) Тогда
				ТекстСМС = ТекстСМС + ", Тел: " + ПодразделениеТелефон;
				Прервать;
			Иначе
				ТекущееПодразделение = ТекущееПодразделение.Родитель;
				Продолжить;
			КонецЕсли;
		КонецЦикла;	  
		ТекстСМС = ТекстСМС + ". Ждём Вас! ";
		ТекстСМС = ТекстСМС + "Напоминаем, что официальный дилер " + Заявка.Организация + ", ";
		ТекстСМС = ТекстСМС + "не производит то с запасными частями и расходными материалами, приобретенными вами у сторонних поставщиков";
		
		СМСОтправлено = ОтправитьСМС(Заявка.Ссылка, ТекстСМС);		
	КонецЦикла;	
КонецПроцедуры

// Получение статусов СМС с портала Билйан
Процедура РегламентноеЗаданиеПроверкаСМСБилайн (Параметры = Неопределено) Экспорт
	ДатаОкончания = НачалоДня(ТекущаяДата()); // запускать после полуночи
	ДатаНачала = ДатаОкончания - 864000;
	смсКоммуникаторБилайн.ПолучитьСтатусыЗаПериод(ДатаНачала, ДатаОкончания);
КонецПроцедуры

Процедура РассылкаСМССоколмоторс(Параметры = Неопределено) Экспорт
	ЗапросДоставка = Новый Запрос;
	ЗапросДоставка.Текст = 
	"ВЫБРАТЬ
	|	смсСостоянияСообщений.Сообщение КАК ДокументСсылка,
	|	смсСостоянияСообщений.НомерСтрокиДокумента,
	|	смсСообщениеПолучатели.НомерТелефона КАК НомерПолучателя,
	|	смсСообщениеПолучатели.ТекстСообщения КАК ТекстСообщения,
	|	смсСостоянияСообщений.GUID,
	|	0 КАК КодОшибки,
	|	смсСостоянияСообщений.sms_id
	|ИЗ
	|	РегистрСведений.смсСостоянияСообщений КАК смсСостоянияСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.SMS.Получатели КАК смсСообщениеПолучатели
	|		ПО смсСостоянияСообщений.Сообщение = смсСообщениеПолучатели.Ссылка
	|			И смсСостоянияСообщений.НомерСтрокиДокумента = смсСообщениеПолучатели.НомерСтроки
	|ГДЕ
	|	смсСостоянияСообщений.Статус = ЗНАЧЕНИЕ(Перечисление.смсСостоянияСообщений.Доставка)
	|ИТОГИ ПО
	|	ДокументСсылка";
	
	РезультатДоставка = ЗапросДоставка.Выполнить();
	Если РезультатДоставка.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
    ВыборкаДокументы = РезультатДоставка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		смсКоммуникаторБилайн.ОтправкаСообщенийДокумента(ВыборкаДокументы.ДокументСсылка, Ложь);
	КонецЦикла;	
КонецПроцедуры

//#Если Клиент Тогда
//#КонецЕсли

//#Если Сервер Тогда	
//#КонецЕсли
